2D_Shear_Layer/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

refmapping
{
    active          true;
    mixtureFractionProperties
    {
        oxidizerMassFractions
        {
            N2              0.765;
            O2              0.23;
            CH4             0.005;
        }
        fuelMassFractions
        {
            NC12H26         1;
        }
        #include        "$FOAM_CASE/constant/foam_mech/thermo.foam"
    }
    tolerance       0.0001;
    deltaT          1;
}

chemistryType
{
    solver          ode_LAPACK;
    method          loadBalanced_pyJac;
}

chemistry       on;

initialChemicalTimeStep 1;

loadbalancing
{
    active          true;
    log             true;
}

odeCoeffs
{
    solver          seulex;
    absTol          1e-10;
    relTol          1e-06;
}

reactions {}

// ************************************************************************* //
