2D_Shear_Layer/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField  #codeStream
{

    code
    #{

        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        const vectorField& CC = mesh.C(); //cell center
        
         
        vectorField U(mesh.nCells());
        scalar Umax = 10;

        scalar L = 0.0015;
        scalar ro = L/20;
        scalar B = 5;
        
        

        forAll(CC,cellI)
        {

            
        	scalar y = CC[cellI].y(); 
        	scalar x = CC[cellI].x(); 

//           U[cellI] = vector(1,0,0)*40-vector(1,0,0)*10*0.5*(tanh(B*(mag(y-L/2)/ro - ro/mag(y-L/2))))+ vector(0,1,0)*(Umax/100)*sin(2*Foam::constant::mathematical::pi*x/(L/4));

	  U[cellI] = vector(1,0,0)*Umax*0.5*(1-tanh(B*(mag(y-L/2)/ro - ro/mag(y-L/2))))+ vector(0,1,0)*(Umax/10000)*sin(2*Foam::constant::mathematical::pi*x/(L/4));

//	if ( (L/2-ro<y) && (L/2+ro>y)  )
//	{
//		U[cellI]=vector(0,0,0);	
//	} 

	
            
    
        }
        
        writeEntry(os,"",U); 
    #};

    //! Optional:
    codeInclude
    #{

        #include "fvCFD.H"

    #};


    codeOptions
    #{

        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude

    #};


    //! libs:

    codeLibs
    #{
        -lmeshTools \
        -lfiniteVolume
    #};

};

boundaryField
{
    upperBoundary
    {
     
        type            zeroGradient;
//        inletValue     $internalField;
//        value          $internalField;
     }
     lowerBoundary
     {
   
        type            zeroGradient;
//        inletValue      $internalField;
//        value          $internalField;   
     }

    leftBoundary
    {
        type            cyclic;
    }

    rightBoundary
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}
// ************************************************************************* //

