2D_Shear_Layer/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "rho.*"
    {
        solver          diagonal;
    }

    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-8;
        relTol           0.005;
    }

    pFinal
    {
        $p;
        tolerance 1e-8;
        relTol           0.0;
    }

    "(U|h|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.005;
    }

    "(U|h|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }

    Yi
    {
        $hFinal;
    }
    YiFinal
    {
        $Yi;
    }


}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors  2;
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
}

// ************************************************************************* //
